[
  {
    "userId": 1,
    "id": 1,
    "title": "St. Andrew Prayer",
    "body": "We humbly beseech Thy Majesty, O Lord, that as the blessed Apostle Andrew, was once a teacher and ruler of Thy Church, so he may ever be our advocate with Thee. Through our Lord, Jesus Christ. Amen. O Christ, our Lord, Who didst beautify the most blessed Andrew with the grace of apostleship, and the crown of martyrdom, by granting to him this special gift, that by preaching the mystery of the cross, he should merit death on the cross; Grant us to become most true lovers of Thy holy cross, and denying ourselves, to take up our cross and follow Thee; That by sharing Thy sufferings in this life, we may deserve the happiness of obtaining life everlasting. Amen.",
    "source": "https://40daysofprayer.org/saint-prayers/St-Andrew.php"
  },
  {
    "userId": 1,
    "id": 2,
    "title": "Mother Angelica Prayer against Discouragement",
    "body": "O God, my mind whirls around in confusion and my soul seems destitute of all consolation. It is as if all the world and all my life were telescoped into one moment and I carry the burden of it all. I cannot see any future except tomorrow being another today. All my yesterdays crowd around me, some accusing and some regret filled. It is like a prison with a thousand voices shouting for attention. Divine Jailor, You have the key to release my soul from the prison of discouragement. Unlock the doors and let me roam freely into the regions of Your love. Deliver me from the tyranny of my own will. Surely You take no pleasure in my soul disquieted within me, for then I am wrapped in myself: Do I hear You whisper, “Unlock the door for the key is within. I wait ready to enter and comfort you.”",
    "source": "https://churchpop.com/2019/03/27/feeling-discouraged-heres-mother-angelicas-prayer-for-strength-through-heavy-burdens/"
  },
  {
    "userId": 1,
    "id": 3,
    "title": "St. Augustine Prayer",
    "body": "Almighty Father, come into our hearts, and so fill us with Thy love that forsaking all evil desires, we may embrace Thee, our only good. Show us, O Lord our God, what Thou are to us. Say to our souls, I am your salvation, speak so that we may hear. Our hearts are before Thee; open our ears; let us hasten after Thy voice. Hide not Thy Face from us, we beseech Thee, O Lord. Open our hearts so that Thou may enter in. Repair the ruined mansions, that Thou may dwell therein. Hear us, O Heavenly Father, for the sake of Thy only Son, Our Lord Jesus Christ, who lives and reigns with Thee and the Holy Spirit, one God now and forever. Amen",
    "source": "https://www.ourcatholicprayers.com/Augustines-prayer-to-our-Almighty-Father.html"
  },
  {
    "userId": 1,
    "id": 4,
    "title": "St. Christopher Prayer",
    "body": "Dear Saint, you have inherited a beautiful name Christopher as a result of a wonderful legend that while carrying people across a raging stream you also carried the Child Jesus. Teach us to be true Christbearers to those who do not know Him. Protect all drivers who often transport those who bear Christ within them. Amen.",
    "source": "https://www.catholicfaithstore.com/daily-bread/prayers-to-saint-christopher/"
  },
  {
    "userId": 1,
    "id": 5,
    "title": "Prayer to Archbishop Fulton J. Sheen",
    "body": "Eternal Father, You alone grant us every blessing in Heaven and on earth, through the redemptive mission of  Your Divine Son, Jesus Christ, and by the working of  the Holy Spirit. If it be according to Your Will, glorify Your servant, ARCHBISHOP FULTON J. SHEEN, by granting the favor I now request through his prayerful intercession (mention your request). I make this prayer confidently through Jesus Christ,our Lord.  Amen.",
    "source": "https://www.bishopsheentoday.com/prayer-for-spiritual-favour/"
  },
  {
    "userId": 1,
    "id": 6,
    "title": "St. George Patron Saint of England Prayer",
    "body": "O God, the merits and prayers of Your Blessed Martyr George are a source of happiness for us. Grant us as a gift of grace the blessings we seek through him. Almighty God, we humly ask (make request here) through the intercession of St. George that we may live a life pleasing to You, and receive the favors we ask, if they are for our good. Amen.",
    "source": "https://www.discountcatholicproducts.com/My-Little-Book-of-Prayers-Male-Saints-P9928.aspx"
  },
  {
    "userId": 1,
    "id": 7,
    "title": "Prayer to St. Gerald",
    "body": "O Almighty and Everlasting God, who did draw to Yourself Saint Gerard, even from his tenderest years, making him conformable to the image of Your Crucified Son, grant we beg You that imitating his example; we may be made like unto the same Divine Imgae, through Jesus Christ Our Lord. Amen.",
    "source": "https://www.discountcatholicproducts.com/My-Little-Book-of-Prayers-Male-Saints-P9928.aspx"
  },
  {
    "userId": 1,
    "id": 8,
    "title": "St. Ignatius of Loyola Prayer Against Depression",
    "body": "O Christ Jesus When all is darkness And we feel our weakness and helplessness, Give us the sense of Your Presence, Your Love and Your Strength. Help us to have perfect trust In Your protecting love And strengthening power, So that nothing may frighten or worry us, For, living close to You, We shall see Your Hand, Your Purpose, Your Will through all things.",
    "source": "https://www.ewtn.com/catholicism/devotions/prayer-against-depression-378"
  },
  {
    "userId": 1,
    "id": 9,
    "title": "Prayer to St. Luke",
    "body": "Most wonderful St. Luke you were animated by the Heavenly Spirit of Love. In faithfully detailing the humanity of Jesus, you also showed His Divinity and His genuine compassion for all human beings. May the Holy Spirit, instructor of the faithful, help me to understand Christ's words and faithfully apply them in my life. Amen.",
    "source": "https://www.discountcatholicproducts.com/My-Little-Book-of-Prayers-Male-Saints-P9928.aspx"
  },
  {
    "userId": 1,
    "id": 10,
    "title": "Prayer to St. Joseph",
    "body": "Oh, St. Joseph, whose protection is so great, so strong, so prompt before the throne of God. I place in you all my interests and desires. Oh, St. Joseph, do assist me by your powerful intercession, and obtain for me from your divine Son all spiritual blessings, through Jesus Christ, our Lord. So that, having engaged here below your heavenly power, I may offer my thanksgiving and homage to the most loving of Fathers. Oh, St. Joseph, I never weary of contemplating you, and Jesus asleep in your arms; I dare not approach while He reposes near your heart. Press Him in my name and kiss His fine head for me and ask him to return the Kiss when I draw my dying breath. St. Joseph, Patron of departing souls - Pray for me.",
    "source": "http://www.newadvent.org/cathen/08504a.htm"
  },
  {
    "userId": 1,
    "id": 11,
    "title": "Prayer to St. Jude",
    "body": "Most holy Apostle, Saint Jude Thaddeus, friend of Jesus, I place myself in your care at this difficult time. Help me know that I need not face my troubles alone. Please join me in my need, asking God to send me: consolation in my sorrow, courage in my fear, and healing in the midst of my suffering. Ask our loving Lord to fill me with the grace to accept whatever may lie ahead for me and my loved ones, and to strengthen my faith in God's healing powers. Thank you, Saint Jude Thaddeus, for the promise of hope you hold out to all who believe, and inspire me to give this gift of hope to others as it has been given to me. Saint Jude, Apostle of Hope. Pray for us!",
    "source": "https://www.ourcatholicprayers.com/prayer-to-st-jude.html"
  },
  {
    "userId": 1,
    "id": 12,
    "title": "Prayer to St. Maximilian Kolbe",
    "body": "O Lord Jesus Christ who said, “No one has greater love than this, to lay down one’s life for one’s friends” through the intercession of St. Maximilian Kolbe, whose life illustrated such love, we beseech You to grant us our petitions. (Mention here the requests you have.) Through the Knights of the Immaculata movement, which Maximilian founded, he spread a fervent devotion to Our Lady throughout the world. He gave up his life for a total stranger and loved his persecutors, giving us an example of unselfish love for all men – a love which was inspired by true devotion to Mary. Grant, O Lord Jesus, that we, too, may give ourselves entirely without reserve to the love and service of our Heavenly Queen in order to better love and serve our fellowman in imitation of your humble servant, St. Maximilian Kolbe. Amen. Three Hail Mary’s and a Glory Be.",
    "source": "https://kolbeshrine.org/prayers-to-st-maximilian-kolbe"
  },
  {
    "userId": 1,
    "id": 13,
    "title": "St. Michael the Archangel Prayer",
    "body": "St. Michael the Archangel,defend us in battle. Be our defense against the wickedness and snares of the Devil. May God rebuke him, we humbly pray, and do thou, O Prince of the heavenly hosts, by the power of God, thrust into hell Satan, and all the evil spirits, who prowl about the world seeking the ruin of souls. Amen.",
    "source": "https://www.ewtn.com/catholicism/devotions/prayer-to-st-michael-the-archangel-371"
  },
  {
    "userId": 1,
    "id": 14,
    "title": "St. Monica",
    "body": "Dear St. Monica, troubled wife and mother, many sorrows pierced your heart during your lifetime. Yet, you never despaired or lost faith. With confidence, persistence, and profound faith, you prayed daily for the conversion of your beloved husband, Patricius, and your beloved son, Augustine; your prayers were answered. Grant me that same fortitude, patience, and trust in the Lord. Intercede for me, dear St. Monica, that God may favorably hear my plea for (Mention your intention here.) and grant me the grace to accept His Will in all things, through Jesus Christ, our Lord, in the unity of the Holy Spirit, one God, forever and ever. Amen.",
    "source": "https://www.catholicdoors.com/prayers/english2/p00570.htm"
  },
  {
    "userId": 1,
    "id": 15,
    "title": "St. Patrick",
    "body": "May the Strength of God guide us. May the Power of God preserve us. May the Wisdom of God instruct us. May the Hand of God protect us. May the Way of God direct us. May the Shield of God defend us. May the Angels of God guard us. - Against the snares of the evil one. May Christ be with us! May Christ be before us! May Christ be in us, Christ be over all! May Thy Grace, Lord, Always be ours, This day, O Lord, and forevermore. Amen.",
    "source": "https://www.catholic.org/prayers/prayer.php?p=2930"
  },
  {
    "userId": 1,
    "id": 16,
    "title": "Prayer for the Intercession of St. Pio of Pietrelcina",
    "body": "Dear God, You generously blessed Your servant, St. Pio of Pietrelcina, with the gifts of the Spirit. You marked his body with the five wounds of Christ Crucified, as a powerful witness to the saving Passion and Death of Your Son. Endowed with the gift of discernment, St. Pio labored endlessly in the confessional for the salvation of souls. With reverence and intense devotion in the celebration of Mass, he invited countless men and women to a greater union with Jesus Christ in the Sacrament of the Holy Eucharist. Through the intercession of St. Pio of Pietrelcina, I confidently beseech You to grant me the grace of (here state your petition). Glory be to the Father… (three times). Amen.",
    "source": "https://padrepiodevotions.org/prayers-of-padre-pio/"
  },
  {
    "userId": 1,
    "id": 17,
    "title": "Prayer to Saint Peregrine (patron saint of cancer patients)",
    "body": "St. Peregrine, whom Holy Mother Church has declared Patron of those suffering from Cancer, I confidently turn to you for help in my present sickness. I beg your kind intercession. Ask God to relieve me of this sickness, if it be his Holy Will. Plead with the Blessed Virgin Mary, the Mother of Sorrows, whom you loved so tenderly and in union with whom you have suffered the pains of Cancer, that she may help me with her powerful prayers and loving consolation. But if it should be God’s Holy Will that I bear this sickness, obtain for me courage and strength to accept these trials from the loving hand of God with patience and resignation, because he knows what is best for the salvation of my soul. St. Peregrine, be my friend and patron. Help me to imitate you in accepting suffering, and to unite myself with Jesus Crucified and the Mother of Sorrows, as you did. I offer my pains to God with all the love of my heart, for his glory and the salvation of souls, especially my own. Amen.",
    "source": "https://www.ourcatholicprayers.com/prayers-to-st-peregrine.html"
  },
  {
    "userId": 1,
    "id": 18,
    "title": "Prayer to Saint Rita",
    "body": "Holy Patroness of those in need, Saint Rita, so humble, pure and patient, whose pleadings with thy Divine Spouse are irresistible, obtain for me from thy Crucified Christ my request (mention it here). Be kind to me, for the greater glory of God, and I promise to honor thee and to sing thy praises forever. Oh glorious St. Rita, who didst miraculously participate in the sorrowful Passion of our Lord Jesus Christ, obtain for me the grace to suffer with resignation the troubles of this life, and protect me in all my needs. Amen",
    "source": "https://www.ourcatholicprayers.com/the-prayer-to-st-rita.html"
  },
  {
    "userId": 1,
    "id": 19,
    "title": "Prayer to Saint Robert",
    "body": "O God, in order to defend the Faith You endowed St. Robert, Your Bishop, with wondrous erudition and virtues. Through his intercession, grant that Your people may ever rejoice in the integrity of the Faith, Amen",
    "source": "https://www.discountcatholicproducts.com/My-Little-Book-of-Prayers-Male-Saints-P9928.aspx"
  },
  {
    "userId": 1,
    "id": 20,
    "title": "Prayer to Saint Rocco",
    "body": "O Great St. Rocco, deliver us, we beseech thee, from the scourges of God; through thy Intercessory, preserve our bodies from contagious diseases, and our souls from the contagion of sin. Obtain for us salubrious air; but, above all, purity of heart. Assist us to make good use of health, to bear suffering with patience; and, after thy example, to live in the practice of penance and charity, that we may one day enjoy the happiness which thou has merited by thy virtues. St. Rocco, pray for us (say three times)",
    "source": "https://www.christian-miracles.com/prayertostrocco.htm"
  },
  {
    "userId": 1,
    "id": 21,
    "title": "Prayer to St. Roch (Rocco)",
    "body": "O Blessed Saint Roch, Patron of the sick, Have pity on those Who lie upon a bed of suffering. Your power was so great When you were in this world, That by the sign of the Cross, Many were healed of their diseases. Now that you are in heaven, Your power is not less. Offer, then, to God Our sighs and tears And obtain for us that health we seek Through Christ our Lord. Amen. (Repeat the following 3 times) Saint Roch, pray for us, That we may be preserved From all diseases of body and soul.",
    "url": "https://churchpop.com/2020/02/28/cure-the-coronavirus-prayers-to-2-incredible-saints-who-miraculously-defeated-plagues/"
  },
  {
    "userId": 1,
    "id": 22,
    "title": "Prayer to St. Rosalie",
    "body": "Father in heaven, we thank You for the communion of saints so that we can draw near to You through the prayers of St. Rosalie. Through her prayers, help us to remember that our destiny is heaven. As St. Rosalie gave up all things in this world for the sake of Your Kingdom, through her prayers, may we love more fully Your Son our Lord Jesus Christ, who together with You and the Holy Spirit are one God forever and ever. Amen. O God, our Father, mercifully look upon Your people who come to You and grant through the intercession of St. Rosalie, who turned away from earthly delights to the joys of contemplation, that we may be delivered from all harm here on earth and one day be welcomed into the Kingdom of Heaven. Rosalie, confessor and virgin, we pray to God for our families and friends. Through your powerful prayers, may we obtain health, life, and eternal salvation. I also pray today for this special need and intention (make your intention known). O glorious virgin and confessor, St. Rosalie, I promise henceforth to remember and follow your example of faith and love. Pray for me and mine. Amen.",
    "url": "https://churchpop.com/2020/02/28/cure-the-coronavirus-prayers-to-2-incredible-saints-who-miraculously-defeated-plagues/"
  },
  {
    "userId": 1,
    "id": 23,
    "title": "Prayer to St. Stephen",
    "body": "Saint Stephen, whom I have chosen as my special patron, pray for me that I, too, may one day glorify the Blessed Trinity in heaven. Obtain for me your lively faith, that I may consider all persons, things, and events in the light of almighty God. Pray, that I may be generous in making sacrifices of temporal things to promote my eternal interests, as you so wisely did. Set me on fire with a love for Jesus, that I may thirst for His sacraments and burn with zeal for the spread of His kingdom. By your powerful intercession, help me in the performance of my duties to God, myself and all the world. Win for me the virtue of purity and a great confidence in the Blessed Virgin. Protect me this day, and every day of my life. Keep me from mortal sin. Obtain for me the grace of a happy death. Amen.",
    "url": "https://40daysofprayer.org/saint-prayers/St-Stephen.php"
  },
  {
    "userId": 1,
    "id": 24,
    "title": "Prayer to St. Therese of Lisieux",
    "body": "O Jesus, dear Holy Child, my only treasure, I abandon myself to Thy every whim. I seek no other joy than that of calling forth Thy sweet Smile. Vouchsafe to me the graces and the virtues of Thy Holy Childhood, so that on the day of my birth into Heaven the Angels and Saints may recognize in Thy Spouse: Teresa of the Child Jesus.",
    "url": "https://www.ourcatholicprayers.com/prayers-of-st-therese.html"
  },
  {
    "userId": 1,
    "id": 25,
    "title": "Prayer to St. Thomas Aquinas",
    "body": "Angel of Schools, at the bidding of Peter, Thousands today are saluting thee thus. We too are claiming thy care and thy counsel, Angel of Schools, be an Angel to us. Come to our aid when thou hearest us calling, Light up the dark, make the rough places plain, Bring to our thoughts the unknown or forgotten, Give us the words that we seek for in vain.",
    "source": "https://www.catholicculture.org/culture/liturgicalyear/prayers/view.cfm?id=991"
  }
]
